EventSamples/ALERT.MLSensor.MailNew/mailman-events-00007.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap:Header>Header</soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.MLSensor.MailNew</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/MLSensor</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:p="http://www.alert-project.eu/panteon" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>MLSensor</ns1:sender>
              <ns1:timestamp>1348472809809</ns1:timestamp>
              <ns1:sequencenumber>6</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1348472809809</ns1:startTime>
                <ns1:endTime>1348472809809</ns1:endTime>
                <ns1:eventName>ALERT.MLSensor.MailNew</ns1:eventName>
                <ns1:eventId>6</ns1:eventId>
                <ns1:eventType>Request</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <r1:message>
                  <r1:from><![CDATA[nkayesmith at gmail.com (Nicholas Kaye-Smith)]]></r1:from>
                  <r1:date>Thu, 05 Jan 2006 08:02:18 +0200</r1:date>
                  <r1:subject><![CDATA[[Kde-hardware-devel] Source question]]></r1:subject>
                  <r1:content><![CDATA[I can help with that.
Also, do you want to set the reply-to address to "This List" in Mailman,
because when I press reply the default reply address is the previous
'poster'?
Nicholas

On 05/01/06, Matt Chorman <mattchorman at gmail.com> wrote:
>
> Perfect! Just a suggestion, you might want to add this tidbit of knowledge
> to
> your website when you get a chance. ;-)
>
> Also, do you have a wiki in the works, or any plans to add one? With a
> project
> as diverse and complex as this one will turn out to be, it might not be a
> bad
> idea.
> --
> Matt
>
> On Wednesday 04 January 2006 8:48 pm, Micha?l Larouche wrote:
> <snip>
> > You can find a start of Solid in SVN here:
> >
> > /branches/work/kdehw/
>
>
> _______________________________________________
> Kde-hardware-devel mailing list
> Kde-hardware-devel at kde.org
> https://mail.kde.org/mailman/listinfo/kde-hardware-devel
>
>
>
>
]]></r1:content>
                </r1:message>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>